# H1
## H2
### H3
#### H4
##### H5
###### H6

> This is a first blockqute
>   > This is a second blockqute
>   >   > This is a third blockqute

1. 첫번째
2. 두번째
3. 세번째

* 빨강
    * 녹색
        * 파랑

+ 빨강
    + 녹색
        + 파랑

- 빨강
    - 녹색
        - 파랑

* 1단계
    - 2단계
        + 3단계
            + 4단계

This is a normal paragraph:

    This is a code block.
    
end code block.

<pre>
<code>
public class{}
</code>
</pre>

"""
public class{}
"""

'''java
public class Boot{}
'''

good luck happy
2022 2002 2002  
Merry Christmas  
hahahah

__진하게__
_이탤릭 기울여서_
~~취소~~
<u>밑줄</u>

$ y=ax + b $
$$ y=ax + b $$

%pwd
%ls
%mkdir   %rmdir
%load 파일명
%%writefile 파일명

import pandas as pd

series = pd.Series(data,index=index)

In [214]:
import pandas as pd

In [215]:
dict_data={'a':1,'b':2,'c':3}

In [216]:
sr=pd.Series(dict_data)

In [217]:
print(type(sr))
print('\n')

<class 'pandas.core.series.Series'>

In [218]:
print(sr)

a    1
b    2
c    3
dtype: int64

RengeIndex 객체 = Series객체.index

Series객체.values

In [219]:
import pandas as pd

In [220]:
list_data = ['2019-01-02',3.14,'ABC',100,True]
sr = pd.Series(list_data)

In [221]:
print(sr)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [222]:
idx=sr.index
print(idx)

RangeIndex(start=0, stop=5, step=1)

In [223]:
val=sr.values
print(val)

['2019-01-02' 3.14 'ABC' 100 True]

In [224]:
import pandas as pd

In [225]:
tup_data=('영인','2010-02-24','여',True)

In [226]:
sr=pd.Series(tup_data,index=['이름','생년월일','성별','학생여부'])

In [227]:
print(sr)

이름              영인
생년월일    2010-02-24
성별               여
학생여부          True
dtype: object

In [228]:
print(sr[0])

영인

C:\Users\KDP-14\AppData\Local\Temp\ipykernel_3016\176620897.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[0])

In [229]:
print(sr['이름'])

영인

In [230]:
print(sr[[1,2]])
print(sr[['생년월일','성별']])

생년월일    2010-02-24
성별               여
dtype: object
생년월일    2010-02-24
성별               여
dtype: object

C:\Users\KDP-14\AppData\Local\Temp\ipykernel_3016\680950689.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[[1,2]])

In [231]:
print(sr[1:2])

생년월일    2010-02-24
dtype: object

In [232]:
print(sr['생년월일':'성별'])

생년월일    2010-02-24
성별               여
dtype: object

dataframe=pd.DataFrame(data)
dataframe=pd.DataFrame(data,index=행 인덱스 배열,column=열 이름 배열)

* data => 파이썬 dict, ndarry. 스칼라 값
* index => 행(Row) 라벨
* column => 열(Column) 라벨

In [233]:
import pandas as pd

In [234]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

In [235]:
df = pd.DataFrame(dict_data)

In [236]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [237]:
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [238]:
import pandas as pd

In [239]:
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],index=['준서','예은'],columns=['나이','성별','학교'])

In [240]:
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [241]:
print(df.index)

Index(['준서', '예은'], dtype='object')

In [242]:
print(df.columns)

Index(['나이', '성별', '학교'], dtype='object')

In [243]:
df.index=['학생1','학생2']

In [244]:
df.columns=['연령','남녀','소속']

In [245]:
print(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [246]:
print(df.index)
print(df.columns)

Index(['학생1', '학생2'], dtype='object')
Index(['연령', '남녀', '소속'], dtype='object')

In [247]:
print(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [248]:
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],index=['준서','예은'],columns=['나이','성별','학교'])
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [249]:
df2=df.rename(columns={'나이':'연령','성별':'남녀','학교':'소속'})

In [250]:
df3=df.rename(index={'준서':'학생1','예은':'학생2'},inplace=True)

In [251]:
print(f'df======{df3}\n{df}')
print(f'df2======\n{df2}')
print(df3)

df======None
     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중
df2======
    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중
None

In [252]:
import pandas as pd

In [253]:
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
 '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [254]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])

In [255]:
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [256]:
df2=df[:]

In [257]:
df2.drop('우현',inplace=True)
print(df2)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

C:\Users\KDP-14\AppData\Local\Temp\ipykernel_3016\1357887882.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('우현',inplace=True)

In [258]:
df3=df[:]
df3.drop(['우현','인아'],axis=0,inplace=True)
df3

C:\Users\KDP-14\AppData\Local\Temp\ipykernel_3016\3347822267.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(['우현','인아'],axis=0,inplace=True)

    수학  영어  음악   체육
서준  90  98  85  100

In [259]:
import pandas as pd

In [260]:
exam_data={'수학':[90,80,70],'영어':[98,80,80],'음악':[85,95,60],'체육':[100,90,90]}

In [261]:
df=pd.DataFrame(exam_data,index=['서준','우현','인아'])
df

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  80  95   90
인아  70  80  60   90

In [262]:
df4=df[:]
df4.drop('수학',axis=1,inplace=True)
df4

C:\Users\KDP-14\AppData\Local\Temp\ipykernel_3016\370977681.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop('수학',axis=1,inplace=True)

    영어  음악   체육
서준  98  85  100
우현  80  95   90
인아  80  60   90

In [263]:
df5=df[:]
df5.drop(['영어','음악'],axis=1,inplace=True)
df5

C:\Users\KDP-14\AppData\Local\Temp\ipykernel_3016\8641746.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df5.drop(['영어','음악'],axis=1,inplace=True)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [264]:
import pandas as pd

In [265]:
exam_data={'수학':[90,80,70],'영어':[98,80,80],'음악':[85,95,60],'체육':[100,90,90]}

In [266]:
df=pd.DataFrame(exam_data,index=['서준','우현','인아'])
df

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  80  95   90
인아  70  80  60   90

In [267]:
label1=df.loc['서준']
label1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [268]:
position1=df.iloc[0]
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [269]:
label2 = df.loc[['서준', '우현']]
label2

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  80  95   90

In [270]:
position2 = df.iloc[[0,1]]
position2

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  80  95   90

In [271]:
label3 = df.loc['서준':'우현']
label3

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  80  95   90

In [272]:
position3 = df.iloc[0:1]
position3

    수학  영어  음악   체육
서준  90  98  85  100

In [273]:
import pandas as pd

In [274]:
exam_data={'이름':['서준','우현','인하'],
 '수학' : [ 90, 80, 70],
 '영어' : [ 98, 89, 95],
 '음악' : [ 85, 95, 100],
 '체육' : [ 100, 90, 90]}

In [275]:
df = pd.DataFrame(exam_data)
df.dtypes
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인하  70  95  100   90

In [276]:
math1=df['수학']  
print(math1)

0    90
1    80
2    70
Name: 수학, dtype: int64

In [277]:
english=df.영어
english

0    98
1    89
2    95
Name: 영어, dtype: int64

In [278]:
music_gym=df[['음악','체육']]
print(music_gym)
print(type(music_gym))

    음악   체육
0   85  100
1   95   90
2  100   90
<class 'pandas.core.frame.DataFrame'>

In [279]:
math2 = df[['수학']]
print(math2)
print(type(math2))

   수학
0  90
1  80
2  70
<class 'pandas.core.frame.DataFrame'>

In [280]:
import pandas as pd

In [281]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
 '수학' : [ 90, 80, 70],
 '영어' : [ 98, 89, 95],
 '음악' : [ 85, 95, 100],
 '체육' : [ 100, 90, 90]}

In [282]:
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [283]:
df.set_index('이름',inplace=True)
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [286]:
a = df.loc['서준','음악']
print(a)

85

In [287]:
b = df.iloc[0,2]
print(b)

85

In [289]:
c= df.loc['서준',['음악','체육']]
print(c)

음악     85
체육    100
Name: 서준, dtype: int64

In [291]:
h = df.iloc[0,[2,3]]
print(h)

음악     85
체육    100
Name: 서준, dtype: int64

In [292]:
e = df.loc['서준','음악':'체육']
print(e)

음악     85
체육    100
Name: 서준, dtype: int64

In [294]:
f = df.iloc[0,2:]
print(f)

음악     85
체육    100
Name: 서준, dtype: int64

In [296]:
g = df.loc[['서준','우현'],['음악','체육']]
g

    음악   체육
이름
서준  85  100
우현  95   90

In [297]:
 j = df.iloc[0:2, 2:]
 print(j)

    음악   체육
이름
서준  85  100
우현  95   90

In [298]:
import pandas as pd

In [301]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
 '수학' : [ 90, 80, 70],
 '영어' : [ 98, 89, 95],
 '음악' : [ 85, 95, 100],
 '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [302]:
df['국어']=80
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [303]:
exam_data = {'이름' : ['서준', '우현', '인아'],
 '수학' : [ 90, 80, 70],
 '영어' : [ 98, 89, 95],
 '음악' : [ 85, 95, 100],
 '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [304]:
df.loc[3]=0
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

In [307]:
df.loc[4] = ['동규',90,80,70,60]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60

In [308]:
df.loc['행'] = df.loc[3]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60
행   0   0   0    0    0

In [309]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
 '수학' : [ 90, 80, 70],
 '영어' : [ 98, 89, 95],
 '음악' : [ 85, 95, 100],
 '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

In [310]:
df.set_index('이름',inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [311]:
df.iloc[0][3]=80
df

C:\Users\KDP-14\AppData\Local\Temp\ipykernel_3016\503377599.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0][3]=80
C:\Users\KDP-14\AppData\Local\Temp\ipykernel_3016\503377599.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.iloc[0][3]=80

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [312]:
df.loc['서준']['체육'] = 90
df

C:\Users\KDP-14\AppData\Local\Temp\ipykernel_3016\982936488.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc['서준']['체육'] = 90

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [313]:
df.loc['서준','체육'] = 100
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [314]:
df.loc['서준',['음악','체육']]=50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [315]:
df.loc['서준',['음악','체육']] = 100,50
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90